kodilla-soap-library/src/main/java/com/kodilla/soap/sample/book-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:kodilla="http://kodilla.com/books/soap">
    <soapenv:Header/>
    <soapenv:Body>
        <kodilla:getBookRequest>
            <kodilla:referenceNumber>TECH/959</kodilla:referenceNumber>
        </kodilla:getBookRequest>
    </soapenv:Body>
</soapenv:Envelope>